# Basic SQL Queries

For more SQL examples in the SQLite3 dialect, seee [SQLite3 tutorial](https://www.techonthenet.com/sqlite/index.php). 

For a deep dive, see [SQL Queries for Mere Mortals](https://www.amazon.com/SQL-Queries-Mere-Mortals-Hands/dp/0134858336/ref=dp_ob_title_bk).

### Data we will work with in Part B

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///data/faculty.db

'Connected: @data/faculty.db'

In [3]:
%%sql

SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///data/faculty.db
Done.

[('table', 'df', 'df', 2, 'CREATE TABLE df (\n\t"index" BIGINT, \n\tperson TEXT, \n\ttime BIGINT, \n\tbsl BIGINT\n)')]

### Basic Structure

```SQL
SELECT DISTINCT value_expression AS alias
FROM tables AS alias
WHERE predicate
ORDER BY value_expression
```

### Types

- Character (Fixed width, variable width)
- National Character (Fixed width, variable width)
- Binary
- Numeric (Exact, Arpproximate)
- Boolean
- DateTime
- Interval

The SQL standard specifies that character strings and datetime literals are enclosed by single quotes. Two single quotes wihtin a string is intepreted as a literal single quote.

```sql
'Gilligan''s island'
```

#### The CAST function

```sql
CAST(X as CHARACTER(10))
```

### Value expreesion

- Literal
- Column reference
- Function
- CASES
- (Value expression)
- (SELECT expression)

which may be prefixed with unary operaors `-` and `+` and combined with binary operators appropriate for the data type.

### Bineary operators

#### Concatenation

```SQL
A || B
```

#### Mathematical

```SQL
A + B
A - B
A * B
A / B
```

#### Data and time arithmetic

```SQL
'2018-08-29' + 3
'11:59' + '00:01'
```

In [4]:
%%sql

SELECT DISTINCT language_name
FROM language
LIMIT 5;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: language
[SQL: SELECT DISTINCT language_name
FROM language
LIMIT 5;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Sorting

```SQL
SELECT DISTINCT value_expression AS alias
FROM tables AS alias
ORDER BY value_expression
```

In [5]:
%%sql

SELECT DISTINCT language_name
FROM language
ORDER BY language_name ASC
LIMIT 5;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: language
[SQL: SELECT DISTINCT language_name
FROM language
ORDER BY language_name ASC
LIMIT 5;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Filtering

For efficiency, place the most stringent filters first.

```SQL
SELECT DISTINCT value_expression AS alias
FROM tables AS alias
WHERE predicate
ORDER BY value_expression
```

#### Predicates for filtering rows

- Comparison operators (=, <>, <, >, <=, >=)
- BETWEEN start AND end
- IN(A, B, C)
- LIKE
- IS NULL
- REGEX

Use NOT prefix for negation

#### Combining predicates

```sql
AND
OR
```

USe parenthesis to indicate order of evaluation for compound statements.

In [6]:
%%sql

SELECT first, last, age
FROM person
WHERE age BETWEEN 16 AND 17
LIMIT 5;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: person
[SQL: SELECT first, last, age
FROM person
WHERE age BETWEEN 16 AND 17
LIMIT 5;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Joins

Joins combine data from 1 or more tables to form a new result set.

#### Natural join

Uses all common columns in Tables 1 and 2 for JOIN

```SQL
FROM Table1 
NATURAL INNER JOIN Table 2
```

#### Inner join

General form of INNER JOIN uisng ON

```SQL
FROM Table1 
INNER JOIN Table2
ON Table1.Column = Table2.Column
```

If there is a common column in both tables

```SQL
FROM Table1
INNER JOIN Table2
USING Column
```

Joining more than two tables

```SQL
From (Table1 
      INNER JOIN Table2
      ON Table1.column1 = Table2.Column1)
      INNER JOIN Table3 
      ON Table3.column2 = Table2.Column2
```

#### Outer join

General form of OUTER JOIN uisng ON

```SQL
FROM Table1 
RIGHT OUTER JOIN Table2
ON Table1.Column = Table2.Column
```

```SQL
FROM Table1 
LEFT OUTER JOIN Table2
ON Table1.Column = Table2.Column
```

```SQL
FROM Table1 
FULL OUTER JOIN Table2
ON Table1.Column = Table2.Column
```

In [7]:
%%sql

SELECT first, last, language_name 
FROM person
INNER JOIN person_language ON person.person_id = person_language.person_id
INNER JOIN language ON language.language_id = person_language.language_id
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: person
[SQL: SELECT first, last, language_name
FROM person
INNER JOIN person_language ON person.person_id = person_language.person_id
INNER JOIN language ON language.language_id = person_language.language_id
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Set operations

```SQL
SELECT a, b 
FROM table1
SetOp
SELECT a, b 
FROM table2
```

wehre SetOp is `INTERSECT`, `EXCEPT`, `UNION` or `UNION ALL`.

#### Intersection

```sql
INTERSECT
```

Alternative using `INNER JOIN`

#### Union

```SQL
UNION
UNION ALL (does not eliminate duplicate rows)
```

#### Difference

```SQL
EXCEPT
```

Alternative using `OUTER JOIN` with test for `NULL`

In [8]:
%%sql

DROP VIEW IF EXISTS language_view;
CREATE VIEW language_view AS
SELECT first, last, language_name 
FROM person
INNER JOIN person_language ON person.person_id = person_language.person_id
INNER JOIN language ON language.language_id = person_language.language_id
;

 * sqlite:///data/faculty.db
Done.
Done.

[]

In [9]:
%%sql

SELECt * 
FROM language_view 
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECt *
FROM language_view
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [10]:
%%sql

SELECt * 
FROM language_view 
WHERE language_name = 'Python'
UNION
SELECt * 
FROM language_view 
WHERE language_name = 'Haskell'
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECt *
FROM language_view
WHERE language_name = 'Python'
UNION
SELECt *
FROM language_view
WHERE language_name = 'Haskell'
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [11]:
%%sql

SELECt * 
FROM language_view 
WHERE language_name IN ('Python', 'Haskell')
ORDER BY first
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECt *
FROM language_view
WHERE language_name IN ('Python', 'Haskell')
ORDER BY first
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Subqueries

#### As column expresions

```SQL
SELECT a, b, 
(
    SELECT MAX(c) 
    FROM table2
    INNER JOIN table1
    USING column1
) as max_c
FROM table1
```

#### As filters

```SQL
SELECT a, b, 
FROM table1
WHERE b > 
(
    SELECT AVG(b)
    FROM table1
)
```

#### Quantified Subqueires

```SQL
ALl
SOME
ANY
EXISTS
```

```SQL
SELECT a, b, 
FROM table1
WHERE EXISTS
(
    SELECT c
    FROM table2
)
```

In [12]:
%%sql

SELECT first, last, language_name
FROM person, language
WHERE language_name IN (
    SELECT language_name 
    FROM language_view
    WHERe first='Abram' AND last='Boyer'
)
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: person
[SQL: SELECT first, last, language_name
FROM person, language
WHERE language_name IN (
    SELECT language_name
    FROM language_view
    WHERe first='Abram' AND last='Boyer'
)
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Aggregate functions

```SQL
COUNT
MIN
MAX
AVG
SUM
```

In [13]:
%%sql

SELECT count(language_name) 
FROM language_view;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECT count(language_name)
FROM language_view;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Grouping

```SQL
SELECT a, MIN(b) AS min_b, MAX(b) AS max_b, AVG(b) AS mean_b
FROM table
GROUP BY a
HAVING mean_b > 5
```

The `HAVING` is analagous to the `WHERE` clause, but filters on aggregate conditions. Note that the `WHERE` statement filters rows BEFORE the grouping is done.

Note: Any variable in the SELECT part that is not an aggregte function needs to be in the GROUP BY part.

```SQL
SELECT a, b, c, COUNT(d)
FROM table
GROUP BY a, b, c
```

In [14]:
%%sql

SELECT language_name, count(*) AS n
FROM language_view
GROUP BY language_name
HAVING n > 45;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECT language_name, count(*) AS n
FROM language_view
GROUP BY language_name
HAVING n > 45;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### The CASE switch

#### Simple CASE

```SQL
SELECT name,
(CASE sex 
 WHEN 'M' THEN 1.5*dose
 WHEN 'F' THEN dose
 END) as adjusted_dose
FROM table
```

#### Searched CASE

```SQL
SELECT name,
(CASE  
 WHEN sex = 'M' THEN 1.5*dose
 WHEN sex = 'F' THEN dose
 END) as adjusted_dose
FROM table
```

In [15]:
%%sql

SELECT first, last, language_name,
(CASE
    WHEN language_name LIKE 'H%' THEN 'Hire'
    ELSE 'FIRE'
END
) AS outcome
FROM language_view
LIMIT 10;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such table: main.person
[SQL: SELECT first, last, language_name,
(CASE
    WHEN language_name LIKE 'H%' THEN 'Hire'
    ELSE 'FIRE'
END
) AS outcome
FROM language_view
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

## C.  Window Functions

We use the PostgreSQL databsaee because window functions are not supported in SQLite3 [yet](https://www.sqlite.org/draft/releaselog/3_25_0.html)

In [16]:
%sql postgresql://cliburn@localhost/bios-823

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///data/faculty.db'])
No module named 'psycopg2'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///data/faculty.db'])

In [17]:
import pandas as pd

In [18]:
import numpy as np

In [19]:
from collections import OrderedDict

In [20]:
np.random.seed(23)
n = 10
df = pd.DataFrame(
    OrderedDict(person=np.random.choice(['A', 'B', 'C', 'D'], n,),
                time=np.random.randint(0, 10, n), 
                bsl=np.random.randint(50, 400, n)))

In [21]:
df.sort_values(['person', 'time'])

  person  time  bsl
8      A     0  115
5      A     2  237
2      A     3  129
7      B     5   86
3      B     6  396
4      C     1  107
1      C     9  347
6      D     5   89
9      D     5  221
0      D     7   98

In [22]:
%sql DROP TABLE IF EXISTS df

 * sqlite:///data/faculty.db
Done.

[]

Magic shortcut to creating a database table from `pandas` DataFrame.

In [23]:
%sql persist df

 * sqlite:///data/faculty.db

'Persisted df'

### Over  creates widows

In [24]:
%%sql

SELECT person, time, bsl, row_number() 
OVER ()
FROM df;

 * sqlite:///data/faculty.db
Done.

[('D', 7, 98, 1),
 ('C', 9, 347, 2),
 ('A', 3, 129, 3),
 ('B', 6, 396, 4),
 ('C', 1, 107, 5),
 ('A', 2, 237, 6),
 ('D', 5, 89, 7),
 ('B', 5, 86, 8),
 ('A', 0, 115, 9),
 ('D', 5, 221, 10)]

### Order by

In [25]:
%%sql

SELECT person, time, bsl, row_number() 
OVER (ORDER BY person, time)
FROM df;

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, 1),
 ('A', 2, 237, 2),
 ('A', 3, 129, 3),
 ('B', 5, 86, 4),
 ('B', 6, 396, 5),
 ('C', 1, 107, 6),
 ('C', 9, 347, 7),
 ('D', 5, 89, 8),
 ('D', 5, 221, 9),
 ('D', 7, 98, 10)]

### Partition by

In [26]:
%%sql

SELECT person, time, bsl, row_number() 
OVER (PARTITION BY person ORDER BY time)
FROM df;

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, 1),
 ('A', 2, 237, 2),
 ('A', 3, 129, 3),
 ('B', 5, 86, 1),
 ('B', 6, 396, 2),
 ('C', 1, 107, 1),
 ('C', 9, 347, 2),
 ('D', 5, 89, 1),
 ('D', 5, 221, 2),
 ('D', 7, 98, 3)]

In [27]:
%%sql

SELECT person, time, bsl, STRING_AGG(CAST(bsl AS TEXT), ', ')
OVER (PARTITION BY person ORDER BY time)
FROM df;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such function: STRING_AGG
[SQL: SELECT person, time, bsl, STRING_AGG(CAST(bsl AS TEXT), ', ')
OVER (PARTITION BY person ORDER BY time)
FROM df;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Specifying rows in window

In [28]:
%%sql

SELECT person, time, bsl, STRING_AGG(CAST(bsl AS TEXT), ', ')
OVER (
    PARTITION BY person
    ORDER BY time
    ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
     )
FROM df;

 * sqlite:///data/faculty.db
(sqlite3.OperationalError) no such function: STRING_AGG
[SQL: SELECT person, time, bsl, STRING_AGG(CAST(bsl AS TEXT), ', ')
OVER (
    PARTITION BY person
    ORDER BY time
    ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
     )
FROM df;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Using window functions

In [29]:
%%sql

SELECT person, time, bsl, 
       row_number() OVER win    AS row_number,
       rank() OVER win          AS rank,
       dense_rank() OVER win    AS dense_rank,
       percent_rank() OVER win  AS percent_rank,
       cume_dist() OVER win     AS cume_dist
FROM df
WINDOW win AS (ORDER BY person);

 * sqlite:///data/faculty.db
Done.

[('A', 3, 129, 1, 1, 1, 0.0, 0.3),
 ('A', 2, 237, 2, 1, 1, 0.0, 0.3),
 ('A', 0, 115, 3, 1, 1, 0.0, 0.3),
 ('B', 6, 396, 4, 4, 2, 0.3333333333333333, 0.5),
 ('B', 5, 86, 5, 4, 2, 0.3333333333333333, 0.5),
 ('C', 9, 347, 6, 6, 3, 0.5555555555555556, 0.7),
 ('C', 1, 107, 7, 6, 3, 0.5555555555555556, 0.7),
 ('D', 7, 98, 8, 8, 4, 0.7777777777777778, 1.0),
 ('D', 5, 89, 9, 8, 4, 0.7777777777777778, 1.0),
 ('D', 5, 221, 10, 8, 4, 0.7777777777777778, 1.0)]

### Using aggregate functions

In [30]:
%%sql

SELECT person, time, bsl,
       SUM(bsl) OVER win    AS bsl_sum,
       AVG(bsl) OVER win    AS bsl_avg,
       MIN(bsl) OVER win    AS bsl_min,
       MAX(bsl) over win as bsl_max,
       FIRST_VALUE(bsl) OVER win as bsl_start,
       LAST_VALUE(bsl) OVER win as bsl_end
FROM df
WINDOW win AS (PARTITION BY person ORDER BY time);

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, 115, 115.0, 115, 115, 115, 115),
 ('A', 2, 237, 352, 176.0, 115, 237, 115, 237),
 ('A', 3, 129, 481, 160.33333333333334, 115, 237, 115, 129),
 ('B', 5, 86, 86, 86.0, 86, 86, 86, 86),
 ('B', 6, 396, 482, 241.0, 86, 396, 86, 396),
 ('C', 1, 107, 107, 107.0, 107, 107, 107, 107),
 ('C', 9, 347, 454, 227.0, 107, 347, 107, 347),
 ('D', 5, 89, 310, 155.0, 89, 221, 89, 221),
 ('D', 5, 221, 310, 155.0, 89, 221, 89, 221),
 ('D', 7, 98, 408, 136.0, 89, 221, 89, 98)]

### Using rows and range to constrain windows

In [31]:
%%sql

SELECT person, time, bsl, 
       GROUP_CONCAT(CAST(bsl AS TEXT), ', ') OVER win AS vals,
       SUM(bsl) OVER win AS bsl_sum,
       AVG(bsl) OVER win AS bsl_avg
FROM df
WINDOW win AS (
    PARTITION BY person
    ORDER BY time
    ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
)
ORDER BY person, time;

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, '115, 237', 352, 176.0),
 ('A', 2, 237, '115, 237, 129', 481, 160.33333333333334),
 ('A', 3, 129, '237, 129', 366, 183.0),
 ('B', 5, 86, '86, 396', 482, 241.0),
 ('B', 6, 396, '86, 396', 482, 241.0),
 ('C', 1, 107, '107, 347', 454, 227.0),
 ('C', 9, 347, '107, 347', 454, 227.0),
 ('D', 5, 89, '89, 221', 310, 155.0),
 ('D', 5, 221, '89, 221, 98', 408, 136.0),
 ('D', 7, 98, '221, 98', 319, 159.5)]

### Frames using Rows and Range

For Range, all rows with the same ORDER BY value are considered peers.

In [32]:
%%sql

SELECT person, time, bsl, 
       GROUP_CONCAT(CAST(bsl AS TEXT), ', ') OVER win AS vals,
       SUM(bsl) OVER win AS bsl_sum,
       AVG(bsl) OVER win AS bsl_avg
FROM df
WINDOW win AS (
    ORDER BY person
    ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
)
ORDER BY person, time;

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, '129, 237, 115', 481, 160.33333333333334),
 ('A', 2, 237, '129, 237', 366, 183.0),
 ('A', 3, 129, '129', 129, 129.0),
 ('B', 5, 86, '129, 237, 115, 396, 86', 963, 192.6),
 ('B', 6, 396, '129, 237, 115, 396', 877, 219.25),
 ('C', 1, 107, '129, 237, 115, 396, 86, 347, 107', 1417, 202.42857142857142),
 ('C', 9, 347, '129, 237, 115, 396, 86, 347', 1310, 218.33333333333334),
 ('D', 5, 89, '129, 237, 115, 396, 86, 347, 107, 98, 89', 1604, 178.22222222222223),
 ('D', 5, 221, '129, 237, 115, 396, 86, 347, 107, 98, 89, 221', 1825, 182.5),
 ('D', 7, 98, '129, 237, 115, 396, 86, 347, 107, 98', 1515, 189.375)]

In [33]:
%%sql

SELECT person, time, bsl, 
       GROUP_CONCAT(CAST(bsl AS TEXT), ', ') OVER win AS vals,
       SUM(bsl) OVER win AS bsl_sum,
       AVG(bsl) OVER win AS bsl_avg
FROM df
WINDOW win AS (
    ORDER BY person
    RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
)
ORDER BY person, time;

 * sqlite:///data/faculty.db
Done.

[('A', 0, 115, '129, 237, 115', 481, 160.33333333333334),
 ('A', 2, 237, '129, 237, 115', 481, 160.33333333333334),
 ('A', 3, 129, '129, 237, 115', 481, 160.33333333333334),
 ('B', 5, 86, '129, 237, 115, 396, 86', 963, 192.6),
 ('B', 6, 396, '129, 237, 115, 396, 86', 963, 192.6),
 ('C', 1, 107, '129, 237, 115, 396, 86, 347, 107', 1417, 202.42857142857142),
 ('C', 9, 347, '129, 237, 115, 396, 86, 347, 107', 1417, 202.42857142857142),
 ('D', 5, 89, '129, 237, 115, 396, 86, 347, 107, 98, 89, 221', 1825, 182.5),
 ('D', 5, 221, '129, 237, 115, 396, 86, 347, 107, 98, 89, 221', 1825, 182.5),
 ('D', 7, 98, '129, 237, 115, 396, 86, 347, 107, 98, 89, 221', 1825, 182.5)]